Project/Toir/src/ChartsOfCharacteristicTypes/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <type>
    <types>Number</types>
    <types>CatalogRef.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>4</scale>
    </numberQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

Project/Toir/src/InformationRegisters/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <resources>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначенияКонтролируемыхПоказателейИзОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.торо_ТипыОбъектовRCM</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КомментарийМатрицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсновноеСредство</name>
    <comment>TOIR20-222</comment>
    <type>
      <types>CatalogRef.гкс_ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МетодПланированияТоир</name>
    <type>
      <types>EnumRef.гкс_МетодыПланированияТоир</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ВыборИзМатрицы</name>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/ChartsOfCharacteristicTypes/торо_ИзмеряемыеПоказателиОбъектовРемонта/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем ИзмеряемыйПоказательДобавляется;

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Видимость и отбор значений.
	Элементы.Панель.ПодчиненныеЭлементы.ЗначенияИзмеряемогоПоказателя.Доступность
	= Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗначенийИзмеряемогоПоказателя, "Владелец", Объект.Ссылка,,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбработатьИзменениеТипаЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Число");
		Объект.ДопустимыйМаксимум  = 0;
		Объект.ДопустимыйМинимум   = 0;
		Объект.КритическийМаксимум = 0;
		Объект.КритическийМинимум  = 0;
	КонецЕсли;
	
	Элементы.Панель.ПодчиненныеЭлементы.ГраницыДопустимыхЗначений.Доступность = Объект.ТипЗначения.СодержитТип(Тип("Число"));
	
	ЗаполнитьТаблицуОР();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверкаУникальностиИНаличияПустыхОР(Отказ); 
	ПроверкаГраницПоказателей(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьОбъектыРемонта(Отказ, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗначенийИзмеряемогоПоказателя, "Владелец", Объект.Ссылка,,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не торо_ОбщегоНазначения.НаименованиеУникально("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта", Объект.Наименование, Объект.Ссылка) Тогда
		
		ТекстСообщения = НСтр("es='El nombre no es único';ru='Наименование не уникально';en='The name is not unique'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	Элементы.Панель.ПодчиненныеЭлементы.ЗначенияИзмеряемогоПоказателя.Доступность = Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта"));
	Элементы.Панель.ПодчиненныеЭлементы.ГраницыДопустимыхЗначений.Доступность = Объект.ТипЗначения.СодержитТип(Тип("Число"));
	Если НЕ Элементы.Панель.ПодчиненныеЭлементы.ЗначенияИзмеряемогоПоказателя.Доступность
		И  Элементы.Панель.ТекущаяСтраница.Имя = "ЗначенияИзмеряемогоПоказателя" Тогда
		Элементы.Панель.ТекущаяСтраница = Элементы.Панель.Подчиненные[0];
	КонецЕсли;
	
	ОбработатьИзменениеТипаЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРемонта
&НаКлиенте
Процедура ОбъектыРемонтаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
	
		Элемент.ТекущиеДанные.Показатель = Объект.Ссылка;
		МодифицированностьОбъектовРемонта = Истина;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	ИмяФормыОбъекта = ?(ТипЗнч(ТекДанные.ОбъектРемонта)=Тип("СправочникСсылка.торо_ОбъектыРемонта"),"Справочник.торо_ОбъектыРемонта.ФормаОбъекта","Справочник.торо_ТиповыеОР.ФормаОбъекта");
	ОткрытьФорму(ИмяФормыОбъекта,Новый Структура("Ключ",ТекДанные.ОбъектРемонта));
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокОР(Команда)
	
	ОбъектыРемонта.Очистить();
	ЗаполнитьТаблицуОР();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗначенийИзмеряемогоПоказателя
&НаКлиенте
Процедура СписокЗначенийИзмеряемогоПоказателяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Вопрос = НСтр("es='¡El índice no es anotado! ¿Anotar?';ru='Показатель еще не записан! Записать?';en='The indicator has not yet been recorded! Record?'");
		Если Не ИзмеряемыйПоказательДобавляется Тогда
			Отказ = Истина;
			ПоказатьВопрос(Новый ОписаниеОповещения("СписокЗначенийИзмеряемогоПоказателяПередНачаломДобавленияЗавершение",ЭтотОбъект),
							Вопрос,РежимДиалогаВопрос.ОКОтмена);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаПриЗаписи

&НаКлиенте
Процедура ПроверкаГраницПоказателей(Отказ)

	ТекстСообщения = "";
	Если ТипЗнч(Объект.КритическийМинимум) = Тип("Число") 
		И ТипЗнч(Объект.ДопустимыйМинимум) = Тип("Число") 
		И ТипЗнч(Объект.ДопустимыйМаксимум) = Тип("Число") 
		И ТипЗнч(Объект.КритическийМаксимум) = Тип("Число") Тогда
		Если Объект.КритическийМинимум > Объект.ДопустимыйМинимум Тогда
			ТекстСообщения = ТекстСообщения + НСтр("es='¡El mínimo crítico supera el mínimo admisible! ';ru='Критический минимум превышает допустимый минимум! ';en='Critical minimum exceeds the allowable minimum! '");
		КонецЕсли;
		Если Объект.ДопустимыйМинимум > Объект.ДопустимыйМаксимум Тогда
			ТекстСообщения = ТекстСообщения + НСтр("es='¡El mínimo admisible supera el máximo admisible! ';ru='Допустимый минимум превышает допустимый максимум! ';en='Allowable minimum exceeds allowable maximum! '");
		КонецЕсли;
		Если Объект.ДопустимыйМаксимум > Объект.КритическийМаксимум Тогда
			ТекстСообщения = ТекстСообщения + НСтр("es='¡El máximo admisible supera el máximo crítico! ';ru='Допустимый максимум превышает критический максимум! ';en='Allowable maximum exceeds critical maximum! '");
		КонецЕсли;
	КонецЕсли;
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения = ТекстСообщения + НСтр("es='¡La anotación es imposible! ¡Prueben redactar las fronteras de los significados admisibles!';ru='Запись невозможна! Попробуйте отредактировать границы допустимых значений!';en='Writing is not possible! Try editing the boundaries of the allowed values!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверкаУникальностиИНаличияПустыхОР(Отказ)

	ТекстСообщения = "";
	МассивДублей = Новый Массив();
	ПараметрыОтбора = Новый Структура();
	
	Для Каждого ТекущаяСтрока Из ОбъектыРемонта Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ОбъектРемонта) Тогда
			ШаблонСообщения = НСтр("es='¡La anotación es imposible! El objeto de la reparación en la línea %1 no es rellenado.';ru='Запись невозможна! Объект ремонта в строке %1 не заполнен.';en='Writing is not possible! Repair object on line%1 is not full.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектыРемонта.Индекс(ТекущаяСтрока) + 1);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе
			ПараметрыОтбора.Вставить("ОбъектРемонта", ТекущаяСтрока.ОбъектРемонта);
			МассивДублейТекущейСтроки = ОбъектыРемонта.НайтиСтроки(ПараметрыОтбора);				
			
			Если МассивДублейТекущейСтроки.Количество() > 1 Тогда
				УжеЕстьВДубликатах = МассивДублей.Найти(ТекущаяСтрока.ОбъектРемонта);
				Если УжеЕстьВДубликатах = Неопределено Тогда			
					
					МассивДублей.Добавить(ТекущаяСтрока.ОбъектРемонта);										
					ШаблонСообщения = НСтр("es=""¡La anotación es imposible! El objeto de la reparación ' %1 ' no es único."";ru=""Запись невозможна! Объект ремонта '%1' не уникален."";en=""Writing is not possible! Repair object '%1' is not unique.""");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущаяСтрока.ОбъектРемонта);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,"ОбъектыРемонта[" + ОбъектыРемонта.Индекс(ТекущаяСтрока) + "].ОбъектРемонта",,Отказ);
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

&НаКлиенте
Процедура СписокЗначенийИзмеряемогоПоказателяПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ  = РезультатВопроса;
	Отказ = Ложь;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗначениеВозврата = ЗаписатьЭлементНаСервере();
		Если ЗначениеВозврата <> Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки(),,,, Отказ);
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Элементы.СписокЗначенийИзмеряемогоПоказателя.ДобавитьСтроку();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЗаписатьЭлементНаСервере()
	
	Попытка
		Отказ = НЕ Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
			Метаданные.ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта,,ОписаниеОшибки());
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуОР()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
		|	ВЫБОР
		|		КОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта ССЫЛКА Справочник.торо_ТиповыеОР
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТиповойОР
		|ИЗ
		|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|ГДЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель = &Показатель
		|	И НЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален";
		Запрос.УстановитьПараметр("Показатель", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НС = ОбъектыРемонта.Добавить();
			
			ЗаполнитьЗначенияСвойств(НС, Выборка);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеТипаЗначения()
	
	Если Объект.ТипЗначения.Типы().Количество() > 1 Тогда
		Если ТипЗнч(Объект.ДопустимыйМаксимум) <> Тип("Число") Тогда
			Объект.ДопустимыйМаксимум = 0;
		КонецЕсли;
		Если ТипЗнч(Объект.ДопустимыйМинимум) <> Тип("Число") Тогда
			Объект.ДопустимыйМинимум = 0;
		КонецЕсли;
		Если ТипЗнч(Объект.КритическийМаксимум) <> Тип("Число") Тогда
			Объект.КритическийМаксимум = 0;
		КонецЕсли;
		Если ТипЗнч(Объект.КритическийМинимум) <> Тип("Число") Тогда
			Объект.КритическийМинимум = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьОбъектыРемонта(Отказ, ТекущийОбъект)
	НаборЗаписей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Показатель.Значение = ТекущийОбъект.Ссылка;
	НаборЗаписей.Отбор.Показатель.Использование = Истина;
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого Строка из ОбъектыРемонта Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Показатель = ТекущийОбъект.Ссылка;
		Если НЕ Запись.ЗначенияКонтролируемыхПоказателейИзОР Тогда
			Запись.ДопустимыйМинимум = ТекущийОбъект.ДопустимыйМинимум;
			Запись.ДопустимыйМаксимум = ТекущийОбъект.ДопустимыйМаксимум;
			Запись.КритическийМинимум = ТекущийОбъект.КритическийМинимум;
			Запись.КритическийМаксимум = ТекущийОбъект.КритическийМаксимум;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
			Метаданные.ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта,,ОписаниеОшибки());
		ТекстСообщения = НСтр("es='No consiguió anotar los destinos de la propiedad: ';ru='Не удалось записать назначения свойства: ';en='Failed to write property assignments: '") + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецПопытки;

КонецПроцедуры

ИзмеряемыйПоказательДобавляется = Ложь;
#КонецОбласти
